app/controllers/movies_controller.rb

SELECT * FROM "movies"
SELECT * FROM "watcheds" WHERE (imdb_id = 'tt0373926' AND user_id = 3)
SELECT * FROM "users" WHERE ("users"."username" = 'tate') LIMIT 1
---
  def index
    @movies = Movie.all
    @watched = Watched.all
    @imdb_base_url = "http://www.imdb.com/title/"
    @current_user_id = User.find_by_username(current_user.username).id

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def show
    @movie = Movie.find(params[:id])

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def edit
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("created_at", "title", "overview", "updated_at") VALUES('2009-12-03 03:55:38', 'Lord of the Rings', 'One of the best movies ever. A classic.', '2009-12-03 03:55:38')
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
UPDATE "movies" SET "updated_at" = '2009-12-10 03:48:05', "title" = 'Lord of the Rings' WHERE "id" = 1
---
  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])

SELECT * FROM "movies" WHERE ("movies"."id" = 2)
DELETE FROM "movies" WHERE "id" = 2
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy

SELECT * FROM "users" WHERE ("users"."username" = 'tate') LIMIT 1
SELECT * FROM "movies" WHERE ("movies"."imdb_id" = 'tt0416449') LIMIT 1
INSERT INTO "movies" ("created_at", "title", "overview", "updated_at", "thumb_img_url", "imdb_id", "released", "original_img_url") VALUES('2009-12-12 18:59:28', '300', 'Based on Frank Miller''s graphic novel, "300" concerns the 480 B.C. Battle of Thermopylae, where the King of Sparta led his army against the advancing Persians; the battle is said to have inspired all of Greece to band together against the Persians, and helped usher in the world''s first democracy.', '2009-12-12 18:59:28', 'http://images.themoviedb.org/posters/18122/300_-_Poster_22__2006__thumb.jpg', 'tt0416449', '2006-12-09 00:00:00', 'http://images.themoviedb.org/posters/18122/300_-_Poster_22__2006_.jpg')
INSERT INTO "watcheds" ("comment", "created_at", "updated_at", "user_id", "imdb_id") VALUES(NULL, '2009-12-12 19:56:41', '2009-12-12 19:56:41', 1, 'tt0416449')
---
  def update_movies_and_watched

    successful_save = true

    params[:seen_movies].each do |movie_details|

      details = movie_details.split("@@")

      #name
      #imdb_id
      #released
      #overview
      #@original_img
      #@thumb_img

      theTime = Time.now

      @watched = Watched.new({:user_id => User.find_by_username(current_user.username).id, :imdb_id => details[1], :created_at => theTime, :updated_at => theTime})

      if !Movie.find_by_imdb_id(details[1])

          @movie = Movie.new({:title => details[0], :imdb_id => details[1], :released => details[2], :overview => details[3], :original_img_url => details[4], :thumb_img_url => details[5], :created_at => theTime, :updated_at => theTime})

          if !@movie.save || !@watched.save