app/controllers/users_controller.rb

  def create
    puts params[:user].length
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password_salt", "last_name", "password_hash", "email", "first_name") VALUES('2009-12-03 03:49:15', '2009-12-03 03:49:15', 'tate', '4dea4ae003c92e11fccf796338b8098a5d700333', NULL, 'c35d13acb02db273b3b655c5afa261b66771acfd', 'taylor.carr@gordon.edu', NULL)