app/controllers/watcheds_controller.rb

SELECT * FROM "watcheds" WHERE (user_id = 1) ORDER BY updated_at DESC
SELECT * FROM "users" WHERE ("users"."username" = 'tate') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "watcheds" WHERE ("watcheds"."id" = 20) LIMIT 1
---
  def index
    @watcheds = Watched.all
    @number_in_row = 0
    @imdb_base_url = "http://www.imdb.com/title/"
    @current_user_id = User.find_by_username(current_user.username).id
    @my_watched = Watched.find(:all, :conditions => ['user_id = ?', @current_user_id], :order => "updated_at DESC")

SELECT * FROM "watcheds" WHERE ("watcheds"."id" = 1)
SELECT * FROM "movies" WHERE ("movies"."imdb_id" = 'tt0121765') LIMIT 1
SELECT * FROM "users" WHERE ("users"."username" = 'tate') LIMIT 1
---
  def show
    @watched = Watched.find(params[:id])
    @movie = Movie.find_by_imdb_id(@watched.imdb_id)
    @imdb_base_url = "http://www.imdb.com/title/"
    @current_user_id = User.find_by_username(current_user.username).id

SELECT * FROM "watcheds" WHERE ("watcheds"."id" = 1)
---
  def edit
    @watched = Watched.find(params[:id])

SELECT * FROM "watcheds" WHERE ("watcheds"."id" = 9)
UPDATE "watcheds" SET "updated_at" = '2009-12-14 23:21:54', "imdb_id" = 'tt079636', "comment" = '' WHERE "id" = 42
---
  def update
    @watched = Watched.find(params[:id])

    respond_to do |format|
      if @watched.update_attributes(params[:watched])

SELECT * FROM "watcheds" WHERE ("watcheds"."id" = 5)
DELETE FROM "watcheds" WHERE "id" = 5
---
  def destroy
    @watched = Watched.find(params[:id])
    @watched.destroy